<?php

namespace Weiliu\Open\Chaty;

class Code
{
    // 其他所有错误
    const C400 = 400;

    /** 基础部分 */

    // 下发指令失败
    const C400000 = 400000;

    // 设备数据不存在
    const C400010 = 400010;
    // 机器人数据不存在
    const C400011 = 400011;
    // 联系人数据不存在
    const C400012 = 400012;
    // 群数据不存在
    const C400013 = 400013;
    // 群联系人数据不存在
    const C400014 = 400014;

    // 设备不在线
    const C400020 = 400020;
    // 机器人不在线
    const C400021 = 400021;

    /** 群部分 */

    // 入群二维码非有效链接
    const C400100 = 400100;
    // 解析入群二维码失败
    const C400101 = 400101;
    // 入群二维码有误
    const C400102 = 400102;
    // 已在群中
    const C400103 = 400103;
    // 群人数超过200人
    const C400104 = 400104;
    // 群人数至少需要3人
    const C400105 = 400105;
    // %s 不是该机器人联系人
    const C400106 = 400106;
    // 该入群二维码已过期
    const C400107 = 400107;
    // 入群二维码入群错误
    const C400108 = 400108;
    // 需要实名验证后才能扫码进群
    const C400109 = 400109;

    /** 联系人部分 */

    // 添加的联系人已经是好友(只存在于微信号搜索添加)
    const C400200 = 400200;
}